Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2C.xml
        <register name="BOD33CTRL" offset="0x2c" rw="RW" size="4" caption="BOD33 Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="HYST" caption="BOD Hysteresis" mask="0x2"/>
          <bitfield name="ACTION" caption="Action" mask="0x300"/>
          <bitfield name="MODE" caption="Operation modes" mask="0x10000"/>
          <bitfield name="FCD" caption="BOD Fuse Calibration Done" mask="0x40000000"/>
          <bitfield name="SFV" caption="BOD Control Register Store Final Value" mask="0x80000000"/>
        </register>
        <register name="BOD33LEVEL" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="BOD33 Level Register">
          <bitfield name="VAL" caption="BOD Value" mask="0x3F"/>
        </register>
        <register name="BOD33SAMPLING" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="BOD33 Sampling Control Register">
          <bitfield name="CEN" caption="Clock Enable" mask="0x1"/>
          <bitfield name="CSSEL" caption="Clock Source Select" mask="0x2"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF00"/>
        </register>
        <register name="BOD18CTRL" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="BOD18 Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="HYST" caption="BOD Hysteresis" mask="0x2"/>
          <bitfield name="ACTION" caption="Action" mask="0x300"/>
          <bitfield name="MODE" caption="Operation modes" mask="0x10000"/>
          <bitfield name="FCD" caption="BOD Fuse Calibration Done" mask="0x40000000"/>
          <bitfield name="SFV" caption="BOD Control Register Store Final Value" mask="0x80000000"/>
        </register>
        <register name="BOD18LEVEL" offset="0x3c" rw="RW" size="4" initval="0x00000000" caption="BOD18 Level Register">
          <bitfield name="VAL" caption="BOD Value" mask="0x3F"/>
          <bitfield name="RANGE" caption="BOD Threshold Range" mask="0x80000000"/>
        </register>
        <register name="VREGCR" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="Voltage Regulator Configuration Register">
          <bitfield name="DIS" caption="Voltage Regulator disable" mask="0x1"/>
          <bitfield name="SSG" caption="Spread Spectrum Generator Enable" mask="0x100"/>
          <bitfield name="SSW" caption="Stop Switching" mask="0x200"/>
          <bitfield name="SSWEVT" caption="Stop Switching On Event Enable" mask="0x400"/>
          <bitfield name="SFV" caption="Store Final Value" mask="0x80000000"/>
        </register>
        <register name="VREGNCSR" offset="0x4c" rw="RW" size="4" initval="0x00000000" caption="Normal Mode Control and Status Register">
        </register>
        <register name="VREGLPCSR" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="LP Mode Control and Status Register">
        </register>
        <register name="RC1MCR" offset="0x58" rw="RW" size="4" initval="0x00000F00" caption="1MHz RC Clock Configuration Register">
          <bitfield name="CLKOE" caption="1MHz RC Osc Clock Output Enable" mask="0x1"/>
          <bitfield name="FCD" caption="Flash Calibration Done" mask="0x80"/>
          <bitfield name="CLKCAL" caption="1MHz RC Osc Calibration" mask="0x1F00"/>
        </register>
        <register name="BGCR" offset="0x5c" rw="RW" size="4" initval="0x00000000" caption="Bandgap Calibration Register">
        </register>
        <register name="BGCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="Bandgap Control Register">
          <bitfield name="ADCISEL" caption="ADC Input Selection" mask="0x3" values="BSCIF_BGCTRL__ADCISEL"/>
          <bitfield name="TSEN" caption="Temperature Sensor Enable" mask="0x100"/>
        </register>
        <register name="BGSR" offset="0x64" rw="R" size="4" initval="0x00000000" caption="Bandgap Status Register">
          <bitfield name="BGBUFRDY" caption="Bandgap Buffer Ready" mask="0xFF" values="BSCIF_BGSR__BGBUFRDY"/>
          <bitfield name="BGRDY" caption="Bandgap Voltage Reference Ready" mask="0x10000"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x20000"/>
          <bitfield name="VREF" caption="Voltage Reference Used by the System" mask="0xC0000"/>
        </register>
        <register name="BR" offset="0x78" rw="RW" size="4" count="4" initval="0x00000000" caption="Backup Register">
        </register>
        <register name="BRIFBVERSION" offset="0x3e4" rw="R" size="4" initval="0x00000100" caption="Backup Register Interface Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="BGREFIFBVERSION" offset="0x3e8" rw="R" size="4" initval="0x00000110" caption="BGREFIFB Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="VREGIFGVERSION" offset="0x3ec" rw="R" size="4" initval="0x00000110" caption="VREGIFA Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="BODIFCVERSION" offset="0x3f0" rw="R" size="4" initval="0x00000110" caption="BODIFC Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="RC32KIFBVERSION" offset="0x3f4" rw="R" size="4" initval="0x00000100" caption="32 kHz RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="OSC32IFAVERSION" offset="0x3f8" rw="R" size="4" initval="0x00000200" caption="32 KHz Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant nubmer" mask="0xF0000"/>
        </register>
        <register name="VERSION" offset="0x3fc" rw="R" size="4" initval="0x00000100" caption="BSCIF Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="BSCIF_UNLOCK__KEY">
        <value name="VALID" caption="Valid Key to Unlock register" value="0xAA"/>
      </value-group>
