Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2C.xml
    <module name="PICOUART" id="I8403" version="1.0.1" caption="Pico UART">
      <register-group name="PICOUART" caption="Pico UART">
        <register name="CR" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="SOURCE" caption="Source Enable Mode" mask="0x3"/>
          <bitfield name="ACTION" caption="Action to perform" mask="0x4"/>
          <bitfield name="MATCH" caption="Data Match" mask="0xFF00"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Interrupt Status" mask="0x1"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x2"/>
        </register>
        <register name="RHR" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="CDATA" caption="Received Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x20" rw="R" size="4" initval="0x00000101" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PM" id="I7146" version="4.4.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="MCCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Main Clock Control">
          <bitfield name="MCSEL" caption="Main Clock Select" mask="0x7"/>
        </register>
        <register name="CPUSEL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CPU Clock Select">
          <bitfield name="CPUSEL" caption="CPU Clock Select" mask="0x7" values="PM_CPUSEL__CPUSEL"/>
          <bitfield name="CPUDIV" caption="CPU Division" mask="0x80"/>
        </register>
        <register name="PBASEL" offset="0xc" rw="RW" size="4" initval="0x00000000" caption="PBA Clock Select">
          <bitfield name="PBSEL" caption="PBA Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBA Division Select" mask="0x80"/>
        </register>
        <register name="PBBSEL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="PBB Clock Select">
          <bitfield name="PBSEL" caption="PBB Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBB Division Select" mask="0x80"/>
        </register>
        <register name="PBCSEL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="PBC Clock Select">
          <bitfield name="PBSEL" caption="PBC Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBC Division Select" mask="0x80"/>
        </register>
        <register name="PBDSEL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="PBD Clock Select">
          <bitfield name="PBSEL" caption="PBD Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBD Division Select" mask="0x80"/>
        </register>
        <register name="CPUMASK" offset="0x20" rw="RW" size="4" initval="0x00000001" caption="CPU Mask">
          <bitfield name="OCD_" caption="OCD CPU Clock Mask" mask="0x1"/>
        </register>
        <register name="HSBMASK" offset="0x24" rw="RW" size="4" initval="0x000001E2" caption="HSB Mask">
          <bitfield name="PDCA_" caption="PDCA HSB Clock Mask" mask="0x1"/>
          <bitfield name="HFLASHC_" caption="HFLASHC HSB Clock Mask" mask="0x2"/>
          <bitfield name="HRAMC1_" caption="HRAMC1 HSB Clock Mask" mask="0x4"/>
          <bitfield name="USBC_" caption="USBC HSB Clock Mask" mask="0x8"/>
          <bitfield name="CRCCU_" caption="CRCCU HSB Clock Mask" mask="0x10"/>
          <bitfield name="HTOP0_" caption="HTOP0 HSB Clock Mask" mask="0x20"/>
          <bitfield name="HTOP1_" caption="HTOP1 HSB Clock Mask" mask="0x40"/>
          <bitfield name="HTOP2_" caption="HTOP2 HSB Clock Mask" mask="0x80"/>
          <bitfield name="HTOP3_" caption="HTOP3 HSB Clock Mask" mask="0x100"/>
          <bitfield name="AESA_" caption="AESA HSB Clock Mask" mask="0x200"/>
        </register>
        <register name="PBAMASK" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="PBA Mask">
          <bitfield name="IISC_" caption="IISC APB Clock Enable" mask="0x1"/>
          <bitfield name="SPI_" caption="SPI APB Clock Enable" mask="0x2"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x8"/>
          <bitfield name="TWIM0_" caption="TWIM0 APB Clock Enable" mask="0x10"/>
          <bitfield name="TWIS0_" caption="TWIS0 APB Clock Enable" mask="0x20"/>
          <bitfield name="TWIM1_" caption="TWIM1 APB Clock Enable" mask="0x40"/>
          <bitfield name="TWIS1_" caption="TWIS1 APB Clock Enable" mask="0x80"/>
          <bitfield name="USART0_" caption="USART0 APB Clock Enable" mask="0x100"/>
          <bitfield name="USART1_" caption="USART1 APB Clock Enable" mask="0x200"/>
          <bitfield name="USART2_" caption="USART2 APB Clock Enable" mask="0x400"/>
          <bitfield name="USART3_" caption="USART3 APB Clock Enable" mask="0x800"/>
          <bitfield name="ADCIFE_" caption="ADCIFE APB Clock Enable" mask="0x1000"/>
          <bitfield name="DACC_" caption="DACC APB Clock Enable" mask="0x2000"/>
          <bitfield name="ACIFC_" caption="ACIFC APB Clock Enable" mask="0x4000"/>
          <bitfield name="GLOC_" caption="GLOC APB Clock Enable" mask="0x8000"/>
          <bitfield name="ABDACB_" caption="ABDACB APB Clock Enable" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x20000"/>
          <bitfield name="PARC_" caption="PARC APB Clock Enable" mask="0x40000"/>
          <bitfield name="CATB_" caption="CATB APB Clock Enable" mask="0x80000"/>
          <bitfield name="TWIM2_" caption="TWIM2 APB Clock Enable" mask="0x200000"/>
          <bitfield name="TWIM3_" caption="TWIM3 APB Clock Enable" mask="0x400000"/>
          <bitfield name="LCDCA_" caption="LCDCA APB Clock Enable" mask="0x800000"/>
        </register>
