Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2C.xml
        <register name="PLL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="PLL0 Control Register">
          <bitfield name="PLLEN" caption="PLL Enable" mask="0x1"/>
          <bitfield name="PLLOSC" caption="PLL Oscillator Select" mask="0x6"/>
          <bitfield name="PLLOPT" caption="PLL Option" mask="0x38"/>
          <bitfield name="PLLDIV" caption="PLL Division Factor" mask="0xF00"/>
          <bitfield name="PLLMUL" caption="PLL Multiply Factor" mask="0xF0000"/>
          <bitfield name="PLLCOUNT" caption="PLL Count" mask="0x3F000000"/>
        </register>
        <register name="DFLL0CONF" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="DFLL0 Config Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="MODE" caption="Mode Selection" mask="0x2"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x4"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x8"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x20"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x40"/>
          <bitfield name="RANGE" caption="Range Value" mask="0x30000"/>
          <bitfield name="FCD" caption="Fuse Calibration Done" mask="0x800000"/>
          <bitfield name="CALIB" caption="Calibration Value" mask="0xF000000"/>
        </register>
        <register name="DFLL0VAL" offset="0x2c" rw="RW" size="4" initval="0x00000000" caption="DFLL Value Register">
          <bitfield name="FINE" caption="Fine Value" mask="0xFF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0x1F0000"/>
        </register>
        <register name="DFLL0MUL" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="DFLL0 Multiplier Register">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
        </register>
        <register name="DFLL0STEP" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="DFLL0 Step Register">
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0xFF"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0x1F0000"/>
        </register>
        <register name="DFLL0SSG" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="DFLL0 Spread Spectrum Generator Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="PRBS" caption="Pseudo Random Bit Sequence" mask="0x2"/>
          <bitfield name="AMPLITUDE" caption="SSG Amplitude" mask="0x1F00"/>
          <bitfield name="STEPSIZE" caption="SSG Step Size" mask="0x1F0000"/>
        </register>
        <register name="DFLL0RATIO" offset="0x3c" rw="R" size="4" initval="0x00000000" caption="DFLL0 Ratio Registe">
          <bitfield name="RATIODIFF" caption="Multiplication Ratio Difference" mask="0xFFFF"/>
        </register>
        <register name="DFLL0SYNC" offset="0x40" rw="W" size="4" initval="0x00000000" caption="DFLL0 Synchronization Register">
          <bitfield name="SYNC" caption="Synchronization" mask="0x1"/>
        </register>
        <register name="RCCR" offset="0x44" rw="RW" size="4" caption="System RC Oscillator Calibration Register">
          <bitfield name="CALIB" caption="Calibration Value" mask="0x3FF"/>
          <bitfield name="FCD" caption="Flash Calibration Done" mask="0x10000"/>
        </register>
        <register name="RCFASTCFG" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="4/8/12 MHz RC Oscillator Configuration Register">
          <bitfield name="EN" caption="Oscillator Enable" mask="0x1"/>
          <bitfield name="TUNEEN" caption="Tuner Enable" mask="0x2"/>
          <bitfield name="JITMODE" caption="Jitter Mode" mask="0x4"/>
          <bitfield name="NBPERIODS" caption="Number of 32kHz Periods" mask="0x70"/>
          <bitfield name="FCD" caption="RCFAST Fuse Calibration Done" mask="0x80"/>
          <bitfield name="FRANGE" caption="Frequency Range" mask="0x300"/>
          <bitfield name="LOCKMARGIN" caption="Accepted Count Error for Lock" mask="0xF000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration Value" mask="0x7F0000"/>
        </register>
        <register name="RCFASTSR" offset="0x4c" rw="RW" size="4" initval="0x00000000" caption="4/8/12 MHz RC Oscillator Status Register">
          <bitfield name="CURTRIM" caption="Current Trim Value" mask="0x7F"/>
          <bitfield name="CNTERR" caption="Current Count Error" mask="0x1F0000"/>
          <bitfield name="SIGN" caption="Sign of Current Count Error" mask="0x200000"/>
          <bitfield name="LOCK" caption="Lock" mask="0x1000000"/>
          <bitfield name="LOCKLOST" caption="Lock Lost" mask="0x2000000"/>
          <bitfield name="UPDATED" caption="Current Trim Value Updated" mask="0x80000000"/>
        </register>
        <register name="RC80MCR" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="80 MHz RC Oscillator Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="FCD" caption="Flash Calibration Done" mask="0x80"/>
          <bitfield name="CALIB" caption="Calibration Value" mask="0x30000"/>
        </register>
        <register name="HRPCR" offset="0x64" rw="RW" size="4" caption="High Resolution Prescaler Control Register">
          <bitfield name="HRPEN" caption="High Resolution Prescaler Enable" mask="0x1"/>
          <bitfield name="CKSEL" caption="Clock Input Selection" mask="0xE"/>
          <bitfield name="HRCOUNT" caption="High Resolution Counter" mask="0xFFFFFF00"/>
        </register>
        <register name="FPCR" offset="0x68" rw="RW" size="4" caption="Fractional Prescaler Control Register">
          <bitfield name="FPEN" caption="High Resolution Prescaler Enable" mask="0x1"/>
          <bitfield name="CKSEL" caption="Clock Input Selection" mask="0xE"/>
        </register>
        <register name="FPMUL" offset="0x6c" rw="RW" size="4" caption="Fractional Prescaler Multiplier Register">
          <bitfield name="FPMUL" caption="Fractional Prescaler Multiplication Factor" mask="0xFFFF"/>
        </register>
