Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2C.xml
        <register name="ODATA" offset="0x50" rw="R" size="4" initval="0x00000000" caption="Output Data Register">
          <bitfield name="ODATA" caption="Output Data" mask="0x1"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000103" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0x70000"/>
        </register>
      </register-group>
    </module>
    <module name="TWIM" id="I7535" version="1.2.0" caption="Two-wire Master Interface">
      <register-group name="TWIM" caption="Two-wire Master Interface">
        <register name="CR" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="MEN" caption="Master Enable" mask="0x1"/>
          <bitfield name="MDIS" caption="Master Disable" mask="0x2"/>
          <bitfield name="SMEN" caption="SMBus Enable" mask="0x10"/>
          <bitfield name="SMDIS" caption="SMBus Disable" mask="0x20"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x80"/>
          <bitfield name="STOP" caption="Stop the current transfer" mask="0x100"/>
        </register>
        <register name="CWGR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Clock Waveform Generator Register">
          <bitfield name="LOW" caption="Clock Low Cycles" mask="0xFF"/>
          <bitfield name="HIGH" caption="Clock High Cycles" mask="0xFF00"/>
          <bitfield name="STASTO" caption="START and STOP Cycles" mask="0xFF0000"/>
          <bitfield name="DATA" caption="Data Setup and Hold Cycles" mask="0xF000000"/>
          <bitfield name="EXP" caption="Clock Prescaler" mask="0x70000000"/>
        </register>
        <register name="SMBTR" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SMBus Timing Register">
          <bitfield name="TLOWS" caption="Slave Clock stretch maximum cycles" mask="0xFF"/>
          <bitfield name="TLOWM" caption="Master Clock stretch maximum cycles" mask="0xFF00"/>
          <bitfield name="THMAX" caption="Clock High maximum cycles" mask="0xFF0000"/>
          <bitfield name="EXP" caption="SMBus Timeout Clock prescaler" mask="0xF0000000"/>
        </register>
        <register name="CMDR" offset="0xc" rw="RW" size="4" initval="0x00000000" caption="Command Register">
          <bitfield name="READ" caption="Transfer Direction" mask="0x1"/>
          <bitfield name="SADR" caption="Slave Address" mask="0x7FE"/>
          <bitfield name="TENBIT" caption="Ten Bit Addressing Mode" mask="0x800"/>
          <bitfield name="REPSAME" caption="Transfer is to same address as previous address" mask="0x1000"/>
          <bitfield name="START" caption="Send START condition" mask="0x2000"/>
          <bitfield name="STOP" caption="Send STOP condition" mask="0x4000"/>
          <bitfield name="VALID" caption="CMDR Valid" mask="0x8000"/>
          <bitfield name="NBYTES" caption="Number of data bytes in transfer" mask="0xFF0000"/>
          <bitfield name="PECEN" caption="Packet Error Checking Enable" mask="0x1000000"/>
          <bitfield name="ACKLAST" caption="ACK Last Master RX Byte" mask="0x2000000"/>
          <bitfield name="HS" caption="HS-mode" mask="0x4000000"/>
          <bitfield name="HSMCODE" caption="HS-mode Master Code" mask="0x70000000"/>
        </register>
        <register name="NCMDR" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Next Command Register">
          <bitfield name="READ" caption="Transfer Direction" mask="0x1"/>
          <bitfield name="SADR" caption="Slave Address" mask="0x7FE"/>
          <bitfield name="TENBIT" caption="Ten Bit Addressing Mode" mask="0x800"/>
          <bitfield name="REPSAME" caption="Transfer is to same address as previous address" mask="0x1000"/>
          <bitfield name="START" caption="Send START condition" mask="0x2000"/>
          <bitfield name="STOP" caption="Send STOP condition" mask="0x4000"/>
          <bitfield name="VALID" caption="CMDR Valid" mask="0x8000"/>
          <bitfield name="NBYTES" caption="Number of data bytes in transfer" mask="0xFF0000"/>
          <bitfield name="PECEN" caption="Packet Error Checking Enable" mask="0x1000000"/>
          <bitfield name="ACKLAST" caption="ACK Last Master RX Byte" mask="0x2000000"/>
          <bitfield name="HS" caption="HS-mode" mask="0x4000000"/>
          <bitfield name="HSMCODE" caption="HS-mode Master Code" mask="0x70000000"/>
        </register>
        <register name="RHR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="RXDATA" caption="Received Data" mask="0xFF"/>
        </register>
        <register name="THR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Transmit Holding Register">
          <bitfield name="TXDATA" caption="Data to Transmit" mask="0xFF"/>
        </register>
        <register name="SR" offset="0x1c" rw="R" size="4" initval="0x00000002" caption="Status Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="MENB" caption="Master Interface Enable" mask="0x10000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
