Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2C.xml
      <value-group name="USART_CR__STTBRK">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted" value="1"/>
      </value-group>
      <value-group name="USART_CR__STTTO">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Starts waiting for a character before clocking the time-out counter" value="1"/>
      </value-group>
      <value-group name="USART_CR__TXDIS">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disables the transmitter" value="1"/>
      </value-group>
      <value-group name="USART_CR__TXEN">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enables the transmitter if TXDIS is 0" value="1"/>
      </value-group>
      <value-group name="USART_CR__FCS">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer)" value="1"/>
      </value-group>
      <value-group name="USART_CR__RCS">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Releases the Slave Select Line NSS (RTS pin)" value="1"/>
      </value-group>
      <value-group name="USART_MR__CHMODE">
        <value name="NORMAL" caption="Normal Mode" value="0"/>
        <value name="ECHO" caption="Automatic Echo. Receiver input is connected to the TXD pin" value="1"/>
        <value name="LOCAL_LOOP" caption="Local Loopback. Transmitter output is connected to the Receiver Input" value="2"/>
        <value name="REMOTE_LOOP" caption="Remote Loopback. RXD pin is internally connected to the TXD pin" value="3"/>
      </value-group>
      <value-group name="USART_MR__CHRL">
        <value name="5" caption="5 bits" value="0"/>
        <value name="6" caption="6 bits" value="1"/>
        <value name="7" caption="7 bits" value="2"/>
        <value name="8" caption="8 bits" value="3"/>
      </value-group>
      <value-group name="USART_MR__CLKO">
        <value name="0" caption="The USART does not drive the SCK pin" value="0"/>
        <value name="1" caption="The USART drives the SCK pin if USCLKS does not select the external clock SCK" value="1"/>
      </value-group>
      <value-group name="USART_MR__CPHA">
        <value name="0" caption="Data is changed on the leading edge of SPCK and captured on the following edge of SPCK" value="0"/>
        <value name="1" caption="Data is captured on the leading edge of SPCK and changed on the following edge of SPCK" value="1"/>
      </value-group>
      <value-group name="USART_MR__CPOL">
        <value name="ZERO" caption="The inactive state value of SPCK is logic level zero" value="0"/>
        <value name="ONE" caption="The inactive state value of SPCK is logic level one" value="1"/>
      </value-group>
      <value-group name="USART_MR__DSNACK">
        <value name="0" caption="NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set)" value="0"/>
        <value name="1" caption="Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted" value="1"/>
      </value-group>
      <value-group name="USART_MR__FILTER">
        <value name="0" caption="The USART does not filter the receive line" value="0"/>
        <value name="1" caption="The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority)" value="1"/>
      </value-group>
      <value-group name="USART_MR__INACK">
        <value name="0" caption="The NACK is generated" value="0"/>
        <value name="1" caption="The NACK is not generated" value="1"/>
      </value-group>
      <value-group name="USART_MR__MODE">
        <value name="NORMAL" caption="Normal" value="0"/>
        <value name="RS485" caption="RS485" value="1"/>
        <value name="HARDWARE" caption="Hardware Handshaking" value="2"/>
        <value name="MODEM" caption="Modem" value="3"/>
        <value name="ISO7816_T0" caption="IS07816 Protocol: T = 0" value="4"/>
        <value name="ISO7816_T1" caption="IS07816 Protocol: T = 1" value="6"/>
        <value name="IRDA" caption="IrDA" value="8"/>
        <value name="LIN_Master" caption="LIN Master" value="10"/>
        <value name="LIN_Slave" caption="LIN Slave" value="11"/>
        <value name="SPI_Master" caption="SPI Master" value="14"/>
        <value name="SPI_Slave" caption="SPI Slave" value="15"/>
      </value-group>
      <value-group name="USART_MR__MODE9">
        <value name="0" caption="CHRL defines character length" value="0"/>
        <value name="1" caption="9-bit character length" value="1"/>
      </value-group>
      <value-group name="USART_MR__NBSTOP">
        <value name="1" caption="1 stop bit" value="0"/>
        <value name="1_5" caption="1.5 stop bits (Only valid if SYNC=0)" value="1"/>
        <value name="2" caption="2 stop bits" value="2"/>
      </value-group>
      <value-group name="USART_MR__OVER">
        <value name="X16" caption="16x Oversampling" value="0"/>
        <value name="X8" caption="8x Oversampling" value="1"/>
      </value-group>
      <value-group name="USART_MR__PAR">
        <value name="EVEN" caption="Even parity" value="0"/>
        <value name="ODD" caption="Odd parity" value="1"/>
        <value name="SPACE" caption="Parity forced to 0 (Space)" value="2"/>
        <value name="MARK" caption="Parity forced to 1 (Mark)" value="3"/>
        <value name="NONE" caption="No Parity" value="4"/>
        <value name="5" caption="No Parity" value="5"/>
        <value name="MULTI" caption="Multi-drop mode" value="6"/>
        <value name="7" caption="Multi-drop mode" value="7"/>
      </value-group>
